Tutorials/Case20/constant/SoildProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      SoildProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


thickness      [0 1 0 0 0 0 0] 1e-9;//基质胶体厚度
Dp           [0 1 0 0 0 0 0] 2e-5;//土颗粒直径 
dp           [0 1 0 0 0 0 0] 2e-6;//基质胶体直径

kB            [1 2 -2 -1 0 0 0] 1.38e-23;//波尔兹曼常数

Tw            [0 0 0 1 0 0 0] 298.15;//绝对温度

h          [0 1 0 0 0 0 0] 3.75e-8;//基质之间的间隔距离

AH            [1 2 -2 0 0 0 0] 1.0281e-20;//Hamaker常数

F            [0 0 1 0 -1 1 0] 96485;//法拉第常数

z             [0 0 0 0 0 0 0]  1;//离子价

Epsilon0            [-1 -3 4 0 0 2 0] 8.85e-12;//真空电容率

Epsilonr       [0 0 0 0 0 0 0] 78.54;//水的相对节电常数

sigma0          [0 -2 1 0 0 1 0] -0.131;//粒子表面的比电荷

R         [1 2 -2 -1 -1 0 0] 8.314;//气体常数

c         [0 -3 0 0 1 0 0] 10;//孔隙水系统中的离子浓度

ker         [0 -1 1 0 0 0 0] 0.0005;//土壤可侵蚀性因子



// ************************************************************************* //
